Autodesk.Revit.DB.Plane.CreateByOriginAndBasis(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Creates a Plane object defined by the two orthogonal unit vectors and passing through the origin point supplied as arguments.
Remarks:
The parametric equation of the plane is S(u, v) = origin + u*basisX + v*basisY. The plane's normal is defined as basisX.Cross(basisY).
origin:
Plane origin. Expected to lie within the Revit design limits Autodesk.Revit.DB.XYZ.IsWithinLengthLimits(Autodesk.Revit.DB.XYZ).
basisX:
First of the two unit vectors that define the plane. Must be orthogonal to the second one.
basisY:
Second of the two unit vectors that define the plane. Must be orthogonal to the first one.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input point lies outside of Revit design limits.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
basisX is not length 1.0.
-or-
basisY is not length 1.0.
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The vectors basisX and basisY are not perpendicular.
Since:
2017

Autodesk.Revit.DB.Plane.CreateByNormalAndOrigin(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Constructs a Plane object from a normal and an origin represented as XYZ objects. Follows the standard conventions for a planar surface.
The constructed Plane object will pass through origin and be perpendicular to normal. The X and Y axes of the plane will be defined arbitrarily.
Remarks:
This function does not guarantee a specific parameterization of the created Plane. Use Plane.Create(Frame) to enforce a specific parameterization of the created Plane object.
normal:
Plane normal. Expected to be a valid non-zero length vector. Doesn't need to be a unit vector.
origin:
Plane origin.  Expected to lie within the Revit design limits Autodesk.Revit.DB.XYZ.IsWithinLengthLimits(Autodesk.Revit.DB.XYZ).
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input point lies outside of Revit design limits.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
normal has zero length.
Since:
2017

Autodesk.Revit.DB.Plane.CreateByThreePoints(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Creates a Plane object passing through three points supplied as arguments.
Remarks:
The points supplied as arguments must fully define a plane: they may not lie on a straight line or be too close to each other. The points must lie within the Revit design limits.
This function does not guarantee a specific parameterization of the created Plane. Use Plane.Create(Frame) to enforce a specific parameterization of the created Plane object.
All three points are expected to lie within the Revit design limits Autodesk.Revit.DB.XYZ.IsWithinLengthLimits(Autodesk.Revit.DB.XYZ).
point1:
First of the three points that define a unique plane. The created Plane object will pass through these points.
point2:
Second of the three points that define a unique plane.
point3:
Third of the three points that define a unique plane.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input point lies outside of Revit design limits.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Throws if the input points do not define a unique plane.
This is typically caused by points being too close to each other, or all three points being on or close to a straight line.
Since:
2017

Autodesk.Revit.DB.Plane.Create(Autodesk.Revit.DB.Frame)
Creates a Plane object defined by a local frame of reference.
Remarks:
The parametric equation of the plane is S(u, v) = Frame.Origin + u*Frame.BasisX + v*Frame.BasisY. Frame.BasisZ defines the plane's normal.
frameOfReference:
frameOfReference is an orthonormal frame that defines a local coordinate system for the plane being constructed.
Frame.Origin is a point on plane. Frame.BasisZ defines the plane's normal, while Frame.BasisX and Frame.BasisY are orthogonal to the normal. The frame may be either left-handed or right-handed (see Frame.IsRightHanded).
Throws Autodesk.Revit.Exceptions.ArgumentException:
This Frame object may not be used as a local frame of reference.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Plane.YVec
Axis defining the second parametric direction of the plane.
Since:
2016

Autodesk.Revit.DB.Plane.XVec
Axis defining the first parametric direction of the plane.
Since:
2016

Autodesk.Revit.DB.Plane.Origin
Plane origin.
Since:
2016

Autodesk.Revit.DB.Plane.Normal
Plane normal.
Since:
2016

Autodesk.Revit.DB.Plane
A Planar surface.
Remarks:
The parametric equation of the plane is S(u, v) = origin + u*xVec + v*yVec.
Since:
2016